Revit 2027 API
SystemsAnalysisOptions Constructor
 Constructs a new instance of the options.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SystemsAnalysisOptions()
Public Sub New
public:
SystemsAnalysisOptions()
new : unit -> SystemsAnalysisOptions
See Also
Reference
SystemsAnalysisOptions Class
Autodesk.Revit.DB.Analysis Namespace